<div>
<p ><img  align="right" src="https://res.cloudinary.com/crunchbase-production/image/upload/c_lpad,h_256,w_256,f_auto,q_auto:eco,dpr_1/aj29iemt0ogdyrdlksd4" height="160px"></p>
</div>

<br>
<br>

# **Aula 03 - Funções do Pandas - Parte II**

**Funções**
* **reset_index**: Redefina os índices.
* **select_dtypes**: Retorna um subconjunto das colunas do DataFrame com base nos tipos de coluna.
* **drop**: Remove linhas ou colunas.
* **assign**: Atribue novas colunas a um DataFrame.
* **astype**: Converta um objeto pandas para um tipo especificado.
* **value_counts**: Retorna uma série contendo contagens de linhas exclusivas no DataFrame.
<br>
<br>
___

**Importação da Biblioteca**

In [1]:
import pandas as pd

*Exercício 1: Utilizando a função reset_index()*

- Importe a biblioteca pandas.
- Crie um DataFrame chamado "dados_alunos" com as colunas "Aluno" e "Idade".
- Configure os índices para as letras "A", "B", "C" e "D".
- Use a função reset_index() para redefinir os índices e imprimir o DataFrame.

In [18]:
lista_dados_alunos = {'Nome': ["Maria", "João", "Pedro", "Ana"],
                            'Idade': ['25', '30', '35', '40']}

dados_alunos = pd.DataFrame(lista_dados_alunos)

dados_alunos.rename(index={0: 'A', 1: 'B', 2: 'C',3:'D'}, inplace=True)


dados_alunos.head(4)

    Nome Idade
A  Maria    25
B   João    30
C  Pedro    35
D    Ana    40

In [5]:
dados_alunos.reset_index(inplace=True, drop=True)
dados_alunos.head(4)

    Nome Idade
0  Maria    25
1   João    30
2  Pedro    35
3    Ana    40

*Exercício 2: Utilizando a função select_dtypes()*

- Importe a biblioteca pandas.
- Crie um DataFrame chamado "dados" com colunas de diferentes tipos de dados, como inteiros, flutuantes e strings.
- Use a função select_dtypes() para selecionar apenas as colunas do tipo int64 e imprima o subconjunto do DataFrame.

In [ ]:

lista_dados_futebol = {
    'Jogador': ["Lionel Messi", "Cristiano Ronaldo", "Mbappé", "Neymar Jr"],
    'Gols': [821, 873, 332, 436],           # Inteiros (int)
    'Média': [0.79, 0.72, 0.65, 0.61],      # Flutuantes (float)
    'Time': ["Inter Miami", "Al-Nassr", "Real Madrid", "Al-Hilal"] # Strings (str)
}


dados_futebol = pd.DataFrame(lista_dados_futebol)

dados_futebol.dtypes
dados_futebol.select_dtypes(include='number')

   Gols  Média
0   821   0.79
1   873   0.72
2   332   0.65
3   436   0.61

*Exercício 3: Utilizando a função drop()*

- Utilize o DataFrame "dados_alunos" criado no exercício 1.
- Use a função drop() para remover a linha com índice "B" e imprima o DataFrame resultante.

In [21]:
dados_alunos.drop('B', inplace=True, axis=0)
dados_alunos.head()

    Nome Idade
A  Maria    25
C  Pedro    35
D    Ana    40

*Exercício 4: Utilizando a função assign()*

- Importe a biblioteca pandas.
- Crie um DataFrame chamado "dados" com as colunas "Nome" e "Idade".
- Utilize a função assign() para adicionar uma nova coluna chamada "Sexo" ao DataFrame e preencha-a com os valores "F", "M" e "F".
* Imprima o DataFrame após a atribuição.

In [24]:
lista_dados = {'Nome': ["Maria", "João", "Pedro", "Ana", "Luiz"],
                            'Idade': ['25', '30', '35', '40','45']}

dados=pd.DataFrame(lista_dados)

dados = dados.assign(Sexo=['F', 'M', 'M', 'F','M'])

dados.head()

    Nome Idade Sexo
0  Maria    25    F
1   João    30    M
2  Pedro    35    M
3    Ana    40    F
4   Luiz    45    M

*Exercício 5: Utilizando a função astype()*

- Importe a biblioteca pandas.
- Crie um DataFrame chamado "dados" com uma coluna que contém números como strings.
- Use a função astype() para converter os valores da coluna em números inteiros.
- Imprima o DataFrame após a conversão.

In [25]:
info_futebol = {
    'Jogador': ["Neymar", "Vinícius Jr", "Marta", "Debinha"],
    'Camisa': ["10", "7", "10", "9"],  
    'Ano_Nascimento': ["1992", "2000", "1986", "1991"] 
}

dados = pd.DataFrame(info_futebol)
dados.dtypes

Jogador           str
Camisa            str
Ano_Nascimento    str
dtype: object

In [27]:
dados['Camisa']=dados['Camisa'].astype(int)
dados.dtypes

Jogador             str
Camisa            int64
Ano_Nascimento      str
dtype: object

*Exercício 6: Utilizando a função value_counts()*

- Importe a biblioteca pandas.
- Crie um DataFrame chamado "dados" com uma coluna que contém nomes de cores.
- Use a função value_counts() para contar as ocorrências únicas de cores no DataFrame e imprima a série resultante.

In [31]:
informacoes = {
    'Cores': ["Vermelho", "Azul", "Verde", "Amarelo", "Azul", "Vermelho", "Azul"],
    'Intensidade': [10, 8, 9, 7, 8, 10, 5]
}

dados_cores = pd.DataFrame(informacoes)

contagem_cores = dados_cores['Cores'].value_counts()

print(contagem_cores)

Cores
Azul        3
Vermelho    2
Verde       1
Amarelo     1
Name: count, dtype: int64